#Определить лежат ли две точки в одной координатной четверти
x = int(input('Первая точка: '))
y = int(input('Вторая точка:'))

x1 = int(input('Первая точка другого координата:'))
y1 = int(input('Вторая точка другого координата:'))

if x > 0 and y > 0 and x1 > 0 and y1 > 0:
    print('Лежат две точки во 1 четверти!')
elif x < 0 and y > 0 and x1 < 0 and y1 > 0:
    print('Лежат две точки во 2 четверти')
elif x < 0 and y < 0 and x1 < 0 and y1 < 0:
    print('Лежат две точки во 3 четверти')
elif x > 0 and y < 0 and x1 > 0 and y1 < 0:
    print('Лежат две точки во 4 четверти')
else:
    print('Две точки не лежат в одной четверти')

